export const platformAgreementText = `
**闪帧 P2V 用户服务协议**  
更新日期：2026年6月6日

**温馨提示：**  
亲爱的用户，欢迎您体验闪帧 P2V 产品及相关服务！闪帧 P2V 是为用户提供 AI 内容生成（图片、音视频、文字等）等服务的创意设计工具平台（以下简称“本服务”或“闪帧 P2V”）。

闪帧 P2V 指由闪帧 P2V 团队（以下简称“我们”）合法拥有并运营的、名称为闪帧 P2V 的官方网站（p2vcom.com）及持续开发上线的客户端应用程序、应用程序编程接口（API）、以及随技术发展出现的其他新形态。

在您点击确认本协议或使用本服务前，请您务必审慎阅读、充分理解《闪帧 P2V 用户服务协议》（以下简称“本协议”）中各条款内容，特别是风险提示、权利许可和信息使用、免除或限制责任、法律适用和争议解决等以粗体下划线显示的条款，您应重点阅读。

当您点击确认本协议或开始使用本服务时，即表示您已充分阅读、理解并接受本协议的全部内容，并与我们达成一致，成为本服务用户，并将受本协议内容约束。本协议自您点击确认之时起或您实际使用本服务的行为发生之时起（以时间在先者为准）生效。如果您不同意本协议的任何内容（包括更新后的内容），您应立即停止使用本服务。

如您对本协议内容有任何疑问、意见或建议，您可通过发送邮件至 77721837@qq.com 与我们联系。

**本协议将帮助您了解以下内容：**  
一、协议的适用范围  
二、服务介绍  
三、用户账号注册与使用  
四、用户行为规范及法律责任  
五、知识产权及相关权益  
六、责任范围与责任限制  
七、协议终止与争议解决  
八、费用  
九、其他  

**一、协议的适用范围**  
1. 本协议适用于您访问和使用闪帧 P2V，不适用于其他第三方向您提供的服务（如接入闪帧 P2V 的应用提供方），请您在使用该等相关服务时，仔细阅读相应产品页面展示的信息及/或相关规则、协议等文件的内容，您同意接受相关服务，即视为您接受与该等第三方之间的权利义务亦受本协议及平台规则的约束。我们亦会要求该等第三方按照法律法规的要求保护您的合法权益。但我们对任何第三方不当服务或违规处理由您提供的信息不承担任何法律责任。  
2. 当您注册登录及使用闪帧 P2V 时，为实现您选择使用的功能、服务，或为遵守法律法规的要求，我们会处理相关个人信息。针对您在使用本服务过程中的个人信息处理和保护相关问题，请您另行阅读《闪帧 P2V 隐私政策》。  
3. 由于 AI 技术快速发展，存在本协议现有约定不能保证完全符合未来技术发展的需求，为此，我们已经发布的、后续可能发布的、或不时修改的与闪帧 P2V 服务有关的其他相关协议、活动规则、公告说明等（统称“平台规则”）均构成本协议不可分割的组成部分，与本协议具有同等法律效力。对于后续我们发布的或修改的平台规则，我们将在为您提供相应服务时向您特别提示或以适当的方式通知您。  
4. 为给您提供更好的服务或基于国家法律法规和政策调整、技术条件、产品功能等变化需要，我们保留随时自行修改本协议和平台规则的权利。我们将采取商业上合理的努力，如通过平台通知等方式，向您通知对本协议和平台规则的重大变更。您可关注本协议条款顶部的“更新日期”、定期查看本协议等方式了解最新变更。在本协议最新更新日期后，您继续访问或使用本服务即表示您接受新条款。如果您不同意新条款，则您必须停止访问或使用本服务。

**二、服务介绍**  
1. 在您遵守本协议的前提下，我们授予您一项不可转让、非排他性、不得用于商业用途的闪帧 P2V 软件使用许可。除非得到我们事先明示的书面授权，否则您将不得以任何未经授权的形式使用闪帧 P2V，包括但不限于复制、传播、改编、爬虫、垂直搜索、镜像或交易等。本协议其他条款未明示授权的其他一切权利仍由我们保留，我们如果未行使前述任何权利，并不构成对该权利的放弃。您确认并同意，若您违反本协议，我们有权随时通知并终止对您的许可授权。  
2. 我们基于人工智能大模型技术，向您提供如下功能与服务：  
（1）使用闪帧 P2V 自助设计、制作、修改、优化、下载、删除、发布您的图片、音视频等内容素材/创意。  
（2）“联想助手”的提示词优化、中英文提示词辅助翻译、模型的训练优化等更好辅助您素材/创意优化的生产力工具；  
（3）闪帧 P2V 持续探索、研发、孵化的其他服务。  
您可结合自身需求输入文字、图片等内容（以下简称“您的输入”）。本服务会基于您的输入，输出相应的内容，包含 AI 生成图片、AI 生成视频等（以下简称“闪帧输出”），具体的输入内容、生成内容类型以产品功能实际情况为准。基于整体服务运营、平台安全、合规经营的需要，在闪帧 P2V 服务提供过程中，我们将使用您的输入和闪帧输出相关内容（或称“服务内容”）。  
3. 为满足用户对于增值服务和更多指定功能的使用需求，我们向您提供了多种可选活动：  
（1）提供用于在闪帧 P2V 平台内兑换相关功能和权益的虚拟道具（如“闪帧积分”），您可以使用该虚拟道具兑换闪帧 P2V 上的特定功能和权益。为免疑义，该虚拟道具是闪帧 P2V 向用户提供的网络技术及相关服务，并非网络支付服务，也不是代币和虚拟货币，不具有货币价值和预付价值（具体虚拟道具相关规则应以您实际获取时的产品界面公示规则及服务权益实际展示为准）；  
（2）开展相关限时或限量活动（如限时用户邀请活动）。如您主动选择参与此类活动，请务必仔细阅读并遵循具体活动界面的活动规则，不得以任何不正当手段或者舞弊方式参与相关活动。一经发现您存在上述行为，我们有权采取收回已领取奖励、限制登录、封禁账号、取消活动规则、限制再次注册等措施，并保留追究违规用户责任的权利。  
4. 您知悉并同意，我们有权根据业务及产品实际情况变更、升级、修改、转移、暂停或终止本服务或部分功能，发生前述情形的不属于违约。您可及时关注本服务不时更新的相关信息或提示。

**三、用户账号注册与使用**  
1. 账号注册的资格：  
（1）您理解并确认，在您开始注册使用闪帧 P2V 服务之前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应承担因您的不当注册行为而导致的一切后果。  
（2）您还需确保您注册账号提供的手机号码系中华人民共和国大陆地区真实、有效且已完成实名认证的手机号码。  
2. 账号注册流程及登录：  
（1）您在访问和使用本服务前需要按照注册页面引导、通过您的实名手机号进行注册，为保证您使用的平台服务安全，您同意通过手机验证码方式对您的个人信息进行验证和合理使用，验证通过并同意签署本协议以及《闪帧 P2V 隐私政策》完成账号注册及登录流程。  
（2）您成功注册账号后，您有权自行修改和设置“用户名”和“头像”等账号信息。  
（3）未经他人明示书面许可，您不得以他人名义开设闪帧 P2V 账号，不得假冒仿冒他人姓名、名称、字号、商标、头像等作为账号信息。使用账号过程中，您不得违反国家法律法规、公序良俗、社会公德、侵犯他人合法权益、违反我们的管理规范，或采取任何方式误导社会公众混淆账号所有者，尤其不得混淆为社会公众普遍知悉的机构或个人。我们有权审核您提交的账号信息，如您提交的账号信息不符合法律、行政法规、政府规章、本协议约定的，我们有权采取警示提醒、限期改正、重置账号信息、限制账号功能、暂停使用、关闭账号、禁止重新注册等法律法规规定的处置措施。  
（4）当您提交的注册信息发生变更时（例如您更换了手机号），您应及时更新相应信息，以使之真实、及时、完整和准确。如您提供的资料错误、不实、过时或不完整的，我们可以向您发出询问及/或要求改正的通知，您应按照我们的要求配合提供或者更新相关资料。因您填写的信息、资料不真实、不及时、不完整或不准确的，您应承担您不能使用账号（不能注册成功、或账号被冻结、注销）或您在使用过程中的后果和损失。  
3. 账号的使用及安全：  
（1）您注册成功的账号仅可供您注册时确认的单一使用主体自身正当使用，不得用于违法违规、损害他方利益等用途；不得恶意批量注册账号；未经我们书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果我们发现或者有合理理由认为使用者并非账号初始注册人，为保障账号安全，我们有权立即暂停或终止向该注册账号提供服务，并有权永久禁用该账号。  
（2）您有责任自行负责保管账号的用户名和密码/验证码等信息的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任。凡使用本服务登录账号和登录凭证的行为，视为您本人的操作，操作所产生的电子信息记录均为本服务用户行为的有效凭据。如果您未保管好自己的账号和验证码而对您、我们或第三方造成的损害，您将负全部责任。  
（3）您不得以任何形式擅自转让或授权他人使用您的账户，因您主动泄露、出借账户信息或因您遭受他人攻击、诈骗等行为导致的损失及后果，我们将不承担任何责任，您可以通过司法、行政等救济途径向侵权行为人追偿。  
（4）如您发现他人未经授权使用您的账号，您应立即通知我们；我们将协助您冻结账号、更改密码或进行其他安全设置；您理解我们对您的请求采取行动需要合理时间，我们对在采取行动前已经产生的以及由您引发的后果（包括但不限于您的任何损失）不承担任何责任。  
（5）当您的账号处于暂时或永久冻结状态时，该账号将无法使用本服务，直至账号恢复正常。  
4. 账号注销：  
在需要终止使用闪帧 P2V 时，您理解并同意以下要求或条件，可以申请注销您的闪帧 P2V 账号：  
（1）您仅能申请注销您本人的账号，请通过闪帧 P2V 官方网站内的注销渠道（如通过【问题反馈】提交您的注销申请）或发送邮件至 77721837@qq.com 与我们联系进行账号注销；  
（2）您仍应对您在注销账号前使用本服务的行为承担相应责任；  
（3）账号注销删除后，我们将对账号内的信息做删除或者匿名化等处理，但法律法规或相关规范对信息保存时间或处理方式另有规定的除外。

**四、用户行为规范及法律责任**  
1. 您知悉并承诺，在使用闪帧 P2V 的过程中：您应遵守国家法律、法规、行政规章等规范性文件以及本协议及平台规则，尊重隐私和公序良俗，不得输入、分享任何未经授权的个人信息、保密信息（包括但不限于商业秘密）及未经授权的其他类型的信息；您应尊重他人合法权益，确保您的输入内容均合法合规、为您本人所有或已获得合法授权，不得输入、分享任何未经授权的内容，不得侵害他人的著作权、专利权、商标权、肖像权、姓名权、声音权益、名誉权、荣誉权等权益；您不得使用闪帧 P2V 服务假冒他人实施侵权违法行为等非法活动，不得利用基于深度学习、虚拟现实、生成式人工智能等新技术新应用生成、制作、发布或传播谣言、不实信息等违法内容。  
2. 您知悉并同意，不得利用我们提供的资源和服务进行或允许第三方进行如下行为：  
（1）对闪帧 P2V 进行反向工程、反汇编、反编译、解码或试图获取其源代码、目标代码或底层结构；  
（2）复制、修改、翻译或创建闪帧 P2V 相关衍生作品；  
（3）出租、出借或出售闪帧 P2V；  
（4）移除闪帧 P2V 的任何权利保护声明或其他专有声明；  
（5）利用闪帧 P2V 或闪帧输出开发或训练与闪帧 P2V 竞争的产品或服务，或进行模型提取/窃取攻击；  
（6）探测、扫描或尝试渗透闪帧 P2V；  
（7）抓取或提取闪帧 P2V 的数据；  
（8）通过输入信息诱导生成违反相关法律法规的内容、恶意对抗过滤机制、形成不友善对话等侵犯我们或第三方合法权益、违反法律法规的行为；  
（9）自行或允许、协助任何人进行任何危害闪帧 P2V 正常运行和系统安全的行为，亦不得利用闪帧 P2V 从事任何危害计算机网络安全的行为；  
（10）使用未经我们授权或许可的任何插件、外挂、系统或第三方工具对本服务的正常运行进行干扰、破坏、修改或施加其他影响；  
（11）违反法律法规、本协议、平台规则及侵犯他人合法权益的其他行为；  
（12）允许或协助第三方实施上述任何行为。  
若发现第三方未经授权的使用，您应立即通知我们并配合制止。如您实施了上述行为，由此引起的法律后果均由您自行承担，我们有权依法追究您的相应法律责任。  
3. 您应当确保您使用本服务过程中所上传、复制、生成、存储、发布、传播的所有内容，不包含以下信息：  
（1）违反国家法律法规禁止性规定的；  
（2）政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；  
（3）欺诈、虚假、不准确或存在误导性的；  
（4）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；  
（5）侮辱或者诽谤他人，侵害他人名誉权、隐私权、肖像权、知识产权或其他合法权益的；  
（6）侵害未成年人合法权益或者损害未成年人身心健康的；  
（7）违反互联网广告相关法律法规的商业广告；  
（8）其他违背社会公共利益、公共道德，或不适合发布的。  
4. 您同意，您从闪帧 P2V 或其他用户处下载、访问或使用的任何内容均由您自行承担使用风险，未经我们书面许可，任何用户、第三方不得以任何方式（包括但不限于盗链、冗余盗取、非法抓取、模拟下载、深度链接、假冒注册等）直接或间接盗取闪帧 P2V 相关的模型、图片、文章等信息内容；或以任何方式（包括但不限于隐藏或者修改域名、平台特有标识、用户名等）删除或改变相关信息内容的权利管理电子信息。  
5. 如果您违反本协议的约定，我们有权视情况采取预先警示、拒绝发布、立即停止传输信息、删除您的输入和闪帧输出以及任何您账户下的相关内容、禁止您使用及发布相关内容、限制账号部分或者全部功能，直至终止提供服务、永久关闭账号及法律法规规定的其他处置措施，对于因此造成本服务功能不可用、账号信息删除、内容删除、无法正常获取您账号内资产或其他权益等不利后果，应由您自行承担。因前述事由已删除的您的内容，我们有权不予恢复。因您的行为导致我们向任何第三方承担赔偿责任，或遭受国家机关处罚，或受到其他经济损失或商誉损失的，您应赔偿相应的全部损失。  
6. 我们尊重并保护用户及他人的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用闪帧 P2V 时上传的文字、图片、音视频或使用其他用户提供的模型生成的文字、图片、音视频等内容时不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，我们有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行处理并承担可能因此产生的全部法律责任；如因您的侵权行为导致我们、控制公司、继承公司或其他用户遭受损失的（包括但不限于经济、商誉等损失），您还应足额赔偿我们、控制公司、继承公司或其他用户遭受的全部损失。  
7. 如您发现本服务内存在任何侵犯您权利的内容，您可以发送邮件至邮箱 77721837@qq.com 通知我们，并提供您享有相关权利的证据，我们将会依据相关法律规定及时处理您的投诉。如您在本服务发布的内容被相关权利人投诉侵权并被处理，且您不认可处理结果，您应根据我们提示的方式（如通过发送邮件至邮箱 77721837@qq.com），向我们提交不侵权声明及相关权利证明材料进行申诉，我们同样将会依据相关法律规定及时处理您的申诉。

**五、知识产权及相关权益**  
1. 我们及相关许可方对闪帧 P2V 软件系统（包括但不限于模型、技术、应用、产品、文字/文案、网页、档案、资讯、资料、网站架构、网站画面的安排、网页设计等）拥有知识产权，未经我们及相关许可方事前书面许可，您不得擅自存储、复制、分析、使用、修订、编辑、发布、传播、展示、翻译、汇编、分发或以其他任何方式使用前述内容。  
2. 我们及相关许可方拥有并保留对本服务、其所有改进、增强或修改，以及与上述内容相关的全部知识产权的所有权、其他所有合法权利、权益及利益。本协议不授予任何默示许可，除本协议明确授予的权利外，我们保留对本服务的一切权利。  
3. 在您遵守本协议的前提下，我们授予您一项不可转让、非排他性、不得用于商业用途的闪帧 P2V 软件使用许可。您确认并同意，若您违反本协议，我们有权随时通知并终止对您的许可授权。  
4. 您确认并承诺，您的输入均由您原创或已获合法授权（且含转授权）。在不违反法律法规的前提下，您或相关许可方保留对“您的输入”所拥有的全部权利、所有权和利益；您同意并授权我们及关联公司可以在提供闪帧 P2V 所必要的范围内使用您的输入。在法律法规规定允许的范围内，您基于您的输入通过闪帧 P2V 生成的内容（即“闪帧输出”）的知识产权（如有）归属于您或依法享有该权益的权利人。  
5. 为持续改善闪帧 P2V 提供的各项功能和服务（包括服务安全性、稳定性等），对于您输入、生成及上传到闪帧 P2V 的任何文件或内容（包括但不限于模型、图片、训练数据等），您授予我们一项全球范围内、永久、免费、非独家、可多层次再许可的权利，以在互联网当前或未来的媒体中以任何形式使用、展示、宣传、推广、下载和/或分发上述文件或内容，或根据您的指示生成闪帧输出。上述许可用于闪帧 P2V 及我们其他相关业务平台。如果您不希望我们用于前述目的，您可通过问题反馈相关页面或发送邮件至 77721837@qq.com 联系我们。  
6. 为了提高闪帧 P2V 服务质量，不断提高模型的准确性和安全性，以及改进模型对您指令的理解能力和响应速度，我们可能会使用到您的输入和闪帧输出进行分析和用于模型训练。如果您不希望我们用于前述目的，您可通过【设置-体验优化计划】选择退出。  
7. 您应当善意地将本服务作为辅助创作的工具，如您拟就 AI 生成内容进行转发或发布时，您应当对 AI 生成内容及使用行为是否符合法律法规规定进行必要审查，必要时还应当寻求专业法律意见，以最大限度地排除知识产权侵权的风险。  
8. 我们珍视并感谢您的意见与建议。如您就现有功能、服务问题或拟议的修改／改进向我们提供任何意见或建议（以下简称“反馈”），即表示您授予我们不受限制且无需向您支付任何报酬即可使用该等反馈的权利。  
9. 您在生成、制作、发布或传播利用人工智能技术生成、合成的非真实信息或其他可能导致公众混淆或误认的信息内容（以下简称“AI 生成内容”）时，我们有权根据《人工智能生成合成内容标识办法》《网络安全技术 人工智能生成合成内容标识方法》等法律法规和强制性国家标准采取适当方式添加相应标识。除非您依我们提供的功能或另行申请并获批准移除显式标识，我们默认对所有生成内容添加显式与隐式标识。  
（1）显式标识  
交互/对话场景：在交互/对话界面的底部或者其他显著位置固定展示“页面包含由 AI 生成的内容，其准确性和完整性无法保障，不代表我们的态度或观点”标识。  
图片生成场景：在左上角添加清晰可辨的 “AI生成” 水印。  
视频生成场景：在左上角添加清晰可辨的 “AI生成” 水印。  
（2）隐式标识  
我们将按国家法律法规和强制性国家标准要求，将隐式标识嵌入生成内容的文件元数据，隐式标识不影响内容的正常使用体验。  
10. 同时，请您仔细阅读并理解相关法律法规关于 AI 标识管理的要求，不得利用基于生成式人工智能等新技术和新应用制作、发布、传播虚假、不实、侵权等违反法律法规的信息。您在发布或传播利用生成式人工智能等新技术和新应用生成的信息时，应当以显著方式予以标识或提示。您不应通过删除、篡改、伪造或者以其他令人误导的方式修改我们添加的 AI 标识。如因您对不含显式标识内容的不当使用、传播或未尽到自行标识义务，而引致任何第三方对我们的投诉、诉讼、索赔，或导致我们受到任何行政、司法机关的处罚或调查，您应独立承担因此产生的全部法律责任，并赔偿我们因此遭受的全部损失。如您非法利用本服务编造、传播虚假信息的，我们会依法保存有关记录，并向网信部门和有关主管部门报告。  
11. 我们理解您在某些特定、合法的应用场景下，可能需要不包含显式标识的生成内容。基于此，本服务为您提供申请获取不含显式标识内容的选项。当您申请并获取不含显式标识的生成内容时，您即成为该内容后续使用与传播的责任主体。您知悉并同意：  
（1）您将对该输出内容的使用行为承担全部法律责任。  
（2）如果相关法律法规、行业规范、或您使用该输出内容的平台/场景要求对人工智能生成内容进行标识，您有义务自行添加符合要求的标识，确保最终用户能够知晓该内容由人工智能生成。  
（3）不将不含显式标识的生成内容用于任何可能误导、欺骗公众，或侵犯他人合法权益（包括但不限于肖像权、名誉权、隐私权、知识产权）的非法或不当用途。  
（4）根据《人工智能生成合成内容标识办法》第九条的规定，我们将依法记录您申请获取不含显式标识内容的用户信息及相关操作日志，并至少保存六个月。  
（5）即使您获取的内容不包含显式标识，其文件元数据中仍将包含用于溯源的隐式标识。

**六、责任范围与责任限制**  
1. 我们可能不时提供测试版服务（包括内测、邀请测试、限量发布、抢先体验等）。我们可随时终止测试版服务且不承担任何责任。  
2. 您对您使用闪帧 P2V（含测试版）的行为全权负责，若因您违反本协议，或其他不当使用行为而产生的所有赔偿责任和费用（包括律师费），您应当对我们和相关方进行赔偿。  
3. 您理解并同意，我们提供的本服务是按照现有技术和条件所能达到的现状提供的。我们会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，我们不能随时预见和防范技术以及其他风险，包括但不限于不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用本服务以及其他的损失和风险。  
4. 您知悉并同意，由于技术发展阶段等限制性因素，当前 AI 模型存在以下局限性：  
（1）输出可能包含错误或误导信息；  
（2）不同用户收到的由 AI 模型自动生成的闪帧输出可能相同或相似，本协议中，您并不获得对其他用户收到的服务内容的任何权利，也并不意味闪帧 P2V 向您授予针对其他用户的任何权利；  
（3）AI 模型基于预设规则，大模型算法运行，不排除缺乏创造性，可能导致输出内容重复或程式化；  
（4）训练数据可能存在质量参差不齐或偏见问题。  
您应审慎评估闪帧输出的准确性、完整性、适当性和安全性，将闪帧输出用于对您产生重大影响的场景前请务必谨慎评估。  
5. 我们依法律规定承担基础保障义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，电力故障，严重疫情，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方原因等而给您造成的损害结果承担责任。  
6. 我们对于您自本服务获得的所有他人、第三方的信息、内容或者广告宣传等任何资讯（以下统称“信息”），除法律明确规定外，不保证真实、准确和完整性。您应知悉使用闪帧 P2V 时发布、分享的信息可能会被他人复制、转载、篡改或做其他非法用途，您在此已充分意识此类风险的存在，并确认此等风险应完全由您自行承担，我们不对任何非与我们直接发生的交易或行为承担任何直接、间接、附带或衍生的损失和责任。  
7. 您知悉并同意，我们非常重视闪帧 P2V 的内容安全问题，将努力采取合理的安全措施来过滤 AI 产出的不当/有害内容，尽可能使得其生成内容符合预期，但可能仍有与预期不符的情况出现。如果您遇到此种情况，请及时与我们反馈，我们将基于您的反馈持续优化 AI 技术能力。  
8. 除非我们另行明确约定或承诺，我们不保证闪帧 P2V 在除官方发布以外的司法辖区内均合法、适当。如果您在闪帧 P2V 官方发布以外的司法辖区使用本服务，您确认该等使用行为是您自身的主动意愿，您将自行保证您使用闪帧 P2V 的行为符合当地所有适用法律的要求，并自行承担相应的风险、责任。  
9. 您知悉并同意，尽管我们不会非法或非经授权地访问、使用、改变或披露您在本服务内上传、存储的用户数据，但我们有权按照法律法规、规范性文件的规定对您通过本服务传输、保存的文件数据，依举报地审查、监督。若存在以不符合本协议的方式使用本服务的行为，我们有权做出独立判断，且有权在无需事先通知的情况下立即终止提供部分或全部服务。对于通过本服务散布和传播反动、色情或其他违反国家法律、法规的信息，我们的系统记录有可能作为违反法律法规证据。如您进行上述内容在本服务的上载、传播而导致任何第三方提出索赔要求或衍生的任何损害或损失，由您自行承担全部责任。我们依据相关法律法规、本协议及平台规则约定，获得审核、处理违法违规内容的权利，但该权利不构成我们的义务或承诺，我们不能保证及时发现违法行为或进行相应处理。  
10. 尽管我们已经尽了最大努力确保功能服务的连贯性和安全性，但由于现阶段科学技术的局限性，我们无法确保所提供的服务毫无瑕疵，也无法随时预见和防范法律、技术以及其他风险。因此，除有效的司法判决外，我们不对闪帧 P2V 引发的任何间接的、偶然的、特殊的或惩罚性的损害赔偿承担责任，即使已被提前告知发生该等损害的可能性。除法律法规另有明确规定外，我们对您承担的全部责任，无论因何原因或何种行为方式，始终不超过您因使用闪帧 P2V 期间而支付给我们的费用（如有）。

**七、协议终止与争议解决**  
1. 本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律。  
2. 若您与我们发生任何争议，双方应尽量友好协商解决；若协商不成，任何一方均可将争议提交至有管辖权的人民法院诉讼解决。  
3. 您有权通过以下任一方式终止本协议：  
（1）变更事项生效前您停止使用本服务，并明示不愿接受变更事项的；  
（2）您明示不愿继续使用本服务的。  
4. 出现以下情况的，我们有权单方面终止本协议：  
（1）您违反本协议约定，我们依据违约条款终止本协议；  
（2）您在使用本服务过程中发布虚假信息、侵犯他人合法权益或存在其他严重违法行为；  
（3）其他应当终止服务的情况。  
本协议终止的，您不能再继续使用闪帧 P2V。  
5. 您理解并同意，本协议终止并不能当然地免除您在本协议有效期间应履行的相关义务，如您在协议终止前存在违约行为，我们仍可依据本协议向您追究违约责任。

**八、费用**  
我们向您提供的服务可能包括免费服务或付费服务，具体以平台页面展示为准，您可以根据需要选择免费服务或付费服务。为清楚起见，我们提供的免费服务不应视为放弃后续收费的权利。

**九、其他**  
1. 您同意我们可以以下任一合理的方式向您送达各类通知：  
（1）官方网站公告；  
（2）站内信、客户端推送消息；  
（3）根据您预留于服务系统里的联系方式发出的电子邮件、短信、函件等；  
（4）其他适当的方式。  
2. 我们有权依本服务或运营的需要决定，安排或指定关联公司或我们认可的第三方公司继续运营本服务，或向其转让本服务。  
3. 您和我们均是独立的主体，在任何情况下本协议不构成我们对您的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。  
4. 本协议中的标题仅为方便阅读而设，并不影响本协议中任何规定的含义或解释。  
5. 如本协议中的任何条款无论因何种原因完全或部分无效或缺乏执行力，本协议的其他条款扔有效且有约束力。  
6. AI 生成内容不代表闪帧 P2V 的态度、观点或立场。由于技术局限性，不排除生成内容不合理、有瑕疵或可能存在其他问题；如您有任何疑问或需要帮助的，欢迎您随时通过网站的问题反馈入口或通过发送邮件至邮箱 77721837@qq.com 联系我们。
`.trim()
